zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
#include "uart_comm.h"
#include "typedef.h"
#include "utils.h"
//#include "aes.h"
//#include "pin_mux.h"
#include "stm32f746xx.h"
#include "cmsis_os.h"

#define dzlog_info debug
#define dzlog_debug debug
#define dzlog_error dberr

//#define AES_CBC_256_DBG

#define WAIT_RESPONSE_TIME_OUT (3000)

#define UART_NUM	2

osThreadId uartSendQueueTaskHandle;
osThreadId uartRecvQueueTaskHandle;
osThreadId uartRecvHandle;

typedef struct {
	unsigned char version[4];
	char file_path[MAX_FILE_PATH_SIZE];
	char type;		//�ļ����ͣ������ļ�Ϊ0��������������ļ�Ϊ1��ͼƬΪ2.
	int file_handle;
	unsigned long size;
	unsigned long aes_padding_len;
	unsigned char md5[MD5_SIZE];
	unsigned int packet_id;
	unsigned long offset;
	char result;
}RECV_FILE_DES;

static RECV_FILE_DES recv_file_des;


//static osStatus jd_master_com_send_play_msg(jd_om_comm *hdl,unsigned char type, void *req_data);

static unsigned char is_req_type_valid(unsigned char type)
{
	if (type >= 0xC0 &&  type <= 0xDF) {
		return 1;
	} else {
		dzlog_error("invalid req type\r\n");
		return 0;
	}
}


static unsigned char is_res_type_valid(unsigned char type)
{
	if (type >= 0xA0 && type <= 0xBF) {
		return 1;
	} else {
		dzlog_error("invalid res type\r\n");
		return 0;
	}
}
#if 0
static bool is_null_data(unsigned char *buf,int buf_size)
{
	bool is_null = true;
	int i=0;

	for(i=0;i<buf_size;i++){
		if((buf[i]&0xFF) != 0){
			is_null = false;
			break;
		}
	}
	return is_null;
}
#endif
void print_hex(char *func,char *data, int len)
{
#if 1
	int i;
	char hex[128] = { 0 };
	//dzlog_debug("%s[%d sec]:\r\n", func,RTC->COUNT);
	for (i = 0; i < len; i++) {
		if (0 == i % 16) {
			dzlog_debug("%s\r\n", hex);
			memset(hex, 0, 128);
		}
		sprintf(hex + 3 * (i % 16), "%02x ", data[i]);
	}
	dzlog_debug("%s\r\n", hex);
#endif
}

static unsigned char get_active_res(int ulTimeOut/*millisecond*/)
{
	unsigned int res = 0;
	if(jd_om_task_notify_wait(&res,ulTimeOut) != osOK)	//timeout
		res = 0;
	return (unsigned char)res;
}
#if 0
static void set_active_res(jd_om_comm *hdl,unsigned char res)
{
	jd_om_task_notify(&(hdl->uart_comm_des.thread_handle_send),res);
	dzlog_debug("set active res as 0x%02x.\r\n", res);
}
#endif
unsigned char wait_response(jd_om_comm *hdl,unsigned char ActiveReq)
{
	//unsigned char ret = 1;
	unsigned char res;
	int cnt = WAIT_RESPONSE_TIME_OUT;
	unsigned char req = ActiveReq;

	if (REQ_TRANS_FILE_HEAD == req)
		cnt = WAIT_RESPONSE_TIME_OUT * 10;
	else if (REQ_TRANS_FILE_DATA== req) //mike:need consider not fetch !
		cnt = WAIT_RESPONSE_TIME_OUT * 20;
	else
		cnt = WAIT_RESPONSE_TIME_OUT * 2;

	while (cnt--) {
		res = get_active_res(1);
		if (0 != res) {
			res &= 0xf;
			req &= 0xf;

			if (res == req)
				return 0;
		}
	}

	return 1;
}
#if 0
static FRESULT f_write_decrypted_aes_data(
	jd_om_comm *hdl,
	FIL* fp,			/* Pointer to the file object */
	char *buff,			/* Pointer to the data to be written */
	UINT btw,			/* Number of bytes to write */
	UINT* bw			/* Pointer to number of bytes written */
)
{
	FRESULT error;
    unsigned char iv[AES_BLOCKLEN];        // init vector
    struct AES_ctx ctx;
    unsigned int len;        // encrypt length (in multiple of AES_BLOCK_SIZE)
    unsigned char padding_len = 0;
    int i;

	if(!is_null_data(hdl->cipher,sizeof(hdl->cipher))){
		dzlog_debug("%s:decrypted data\r\n",__func__);

		if((btw%AES_BLOCKLEN) != 0){
			dzlog_error("%s:encrypted data len is not the multiple of AES block ???\r\n",__func__);
			return FR_INVALID_OBJECT;
		}
		for (i=0; i<AES_BLOCKLEN; ++i) {
			iv[i] = 0;
		}
		len = btw;
		AES_init_ctx_iv(&ctx, (uint8_t *)hdl->cipher, iv);
		AES_CBC_decrypt_buffer(&ctx, (uint8_t *)buff, len);
		//print_hex((char *)__func__,buff,len);	//before trim padding
		padding_len = buff[len-1];
		recv_file_des.aes_padding_len += padding_len;
		len -= padding_len;
		//print_hex((char *)__func__,buff,len);	//after trim padding
	#ifdef AES_CBC_256_DBG
		//eject test only
		dzlog_debug("%s:test eject !!!!!!!!!!!!!\r\n",__func__);
		return FR_INVALID_OBJECT;
	#endif
		error = f_write(fp, buff, len, bw);

		if(len != *bw)
			error = FR_INVALID_OBJECT;
	}
	else{
		dzlog_debug("%s:raw data\r\n",__func__);
		error = f_write(fp, buff, btw, bw);
		if(btw != *bw)
			error = FR_INVALID_OBJECT;

	}
	return error;
}

static void file_move_to_destination(char *file_path,FileType type)
{
	char old_file[MAX_FILE_PATH_SIZE]={0};
	unsigned char old_md5[MD5_SIZE] = { 0 };
	unsigned char new_md5[MD5_SIZE] = { 0 };
	unsigned char file_Dev = SYSDISK;
	unsigned long file_len = 0;
	FRESULT error;

	strncpy(old_file,file_path,strlen(file_path));
	memset(file_path,0,MAX_FILE_PATH_SIZE);
	switch(type){
		case upgrade_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", UPGRADE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case schedule_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", SCHEDULE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case picture_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", PIC_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case voice_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"/%s", strrchr(old_file,'/')+1);
			file_Dev = MP3DISK;
			break;

		default:
			dzlog_error("%s:recv unknown file type %d ???\r\n",__func__,type);
			return;
	}

#ifdef PRIVATE_MP3_FLASH_FS
	if(type == voice_file){
		file_len = get_file_size(SYSDISK,old_file);
		if(PrivateMp3PlayerValidFileSize(file_len)){
			PrivateMp3PlayerSaveFile(old_file);
		}
		else{
			dzlog_error("%s:file size '%d' too large,deny to save !!!\r\n",__func__,file_len);
		}
		ff_unlink(SYSDISK,old_file);
		return;
	}
#endif

	again:
	error = ff_rename(file_Dev,old_file,file_path);
	if(error){
		//fail
		dberr("%s: rename file '%s' to '%s' error=%d\r\n",__func__,old_file,file_path,error);
		if(error == FR_EXIST){	//file exist !
			get_md5(file_Dev,old_md5, old_file, 0);
			get_md5(file_Dev,new_md5, file_path, 0);
			if (0 != memcmp(old_md5, new_md5, MD5_SIZE)) {
				dzlog_error("%s:not the same file,remove '%s',try again...\r\n",__func__,file_path);
				ff_unlink(file_Dev,file_path);
				goto again;
			}
			else{
				dzlog_debug("%s:the same file,ignore rename to '%s'...\r\n",__func__,file_path);
				ff_unlink(file_Dev,old_file);
			}
		}
	}
	else{
		//ok
		dberr("%s: rename file '%s' to '%s' sucessful\r\n",__func__,old_file,file_path);
	}
	return;
}

