zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
	for(i=0;i<sizeof(volume_table)/sizeof(volume_relation);i++){
		if(vol == volume_table[i].val){
			*out_lvl = volume_table[i].level;
			break;
		}
	}
}

static void jd_master_com_fill_device_info(jd_om_comm *hdl,RES_DEVICE_INFO_T **res)
{
	int material_num = 0,i = 0;
	RES_DEVICE_INFO_T *response = NULL;
	unsigned char dev_ready = 0;
	bool mute_on = false;
	unsigned char volume = 0;
	voice_volume_level volume_level = volume_mute;

#ifdef PLAY_SCHEDULE_LIST
	AdvMaterialInfo *adv_material = NULL;
	MaterialList *_Materal = NULL;
	if(jd_om_mutex_try_lock(&(hdl->uart_comm_des.schedule_mutex))){
		//no ready
		dzlog_error("%s:schedule no_ready wait@1?\r\n",__func__);
	}
	else{
		if(hdl->uart_comm_des.current_schedule == NULL){
			//no ready
			jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
			dzlog_error("%s:schedule no_ready wait@2?\r\n",__func__);
		}

		else if(hdl->uart_comm_des.current_schedule->InCritical){
			//no ready
			jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
			dzlog_error("%s:schedule in critical wait@3?\r\n",__func__);
		}
		else
			dev_ready = 1;
	}

	if(dev_ready){
		material_num = hdl->uart_comm_des.current_schedule->total_num;
		*res = jd_om_malloc(sizeof(RES_DEVICE_INFO_T) + material_num*sizeof(AdvMaterialInfo));
		//fill device status
		response = *res;
		response->ready_flag = 1;
		response->Encrypted = is_null_data(hdl->cipher,sizeof(hdl->cipher))?0:1;
		pic_play_get_mp3_volume_info(&mute_on,&volume);
		jd_master_get_volume_level(volume,&volume_level);
		response->volume = mute_on?0:volume_level;	//0:mute,1:low,2:middle,3:high.
		memset(response->sn,0,sizeof(response->sn));
		jd_master_com_get_dev_sn((unsigned char *)(response->sn));
		jd_master_com_get_dev_id((unsigned char *)(response->device_id));
		jd_master_com_get_hw_ver(hdl,response->hw_ver);
		jd_master_com_get_fw_ver(response->fw_ver);
		//fill schedule info
		response->schedule.schedule_id = hdl->uart_comm_des.current_schedule->scheduleId;
		memcpy(response->schedule.schedule_md5,hdl->uart_comm_des.current_schedule->file_md5,16);
		response->schedule.material_num = material_num;
		//file material array
		if(material_num > 0){
			adv_material = (AdvMaterialInfo *)((unsigned char *)response + sizeof(RES_DEVICE_INFO_T));
			_Materal = hdl->uart_comm_des.current_schedule->first_material;
			for(i=0;i<material_num;i++){
				adv_material[i].service_code = _Materal->material.service_code;
				//picture info.
				adv_material[i].pic_material_id = _Materal->material.materialId;
				adv_material[i].pic_play_count = _Materal->material.playCount;
				memcpy(adv_material[i].pic_md5,_Materal->material.file_md5,16);
				//voice info.
				adv_material[i].voice_material_id = _Materal->material.voice_materialId;
				adv_material[i].voice_play_count = FILE_MD5_IS_NULL(_Materal->material.voice_file_md5)?0:(_Materal->material.playCount);
				memcpy(adv_material[i].voice_md5,_Materal->material.voice_file_md5,16);
				_Materal = _Materal->next;
			}
		}
		jd_om_mutex_unlock(&(hdl->uart_comm_des.schedule_mutex));
	}
	else{
		*res = jd_om_malloc(sizeof(RES_DEVICE_INFO_T));
		response = *res;
		response->ready_flag = 0;
	}
#endif
}
#endif
static char recv_data_dispatch(jd_om_comm *hdl,char *pt,bool *file_trans,UINT *trans_timeout_cnt)
{
	char payload[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	MSG_UART_HEAD_T* head = (MSG_UART_HEAD_T*)pt;
	static unsigned char last_session_id = -1;
	//static unsigned int old_pkt_id = 1;
	unsigned int payload_len = 0;
	unsigned char type;

	bool has_send_res = false;

	// 获取start字段
	unsigned char start = head->start;

	//	判断start字段值是否正�?
	if (START_CMD != start) {
		dzlog_error("recv invalid packet\r\n");
		has_send_res = true;	//don't send res as invalid start code.
		goto FREE;
	}

	// 获取type字段
	type = head->type;
	dzlog_debug("recv type %02x\r\n", type);

	//判断start字段值是否正�?
	if (!is_req_type_valid(type)){
		has_send_res = true;	//don't send res as valid command type
		goto FREE;
	}

	if(head->packet_id == last_session_id){
		dzlog_error("recv repeat packet\r\n");
		goto FREE;
	}
	else{
		last_session_id = head->packet_id;
	}

	// 获取payload_len字段
	//payload_len = 0;
	//memcpy(&payload_len, &(head->payload_len), sizeof(payload_len));
	payload_len = head->payload_len;

	// 校验payload_len合法�?
	if (payload_len >= MAX_QUEUE_ELEMENT_SIZE) {
		dzlog_error("recv invalid payload_len:%d\r\n",payload_len);
		goto FREE;
	}

	// 获取payload
	memset(payload, 0, MAX_QUEUE_ELEMENT_SIZE);
	memcpy(payload, pt + sizeof(MSG_UART_HEAD_T), payload_len);


	//获取checksum
	unsigned short chksum;
	memcpy(&chksum, pt + sizeof(MSG_UART_HEAD_T) + payload_len, sizeof(chksum));
	if (chksum != crc16(pt, sizeof(MSG_UART_HEAD_T) + payload_len)) {
		dzlog_error("checksum wrong\r\n");
		goto FREE;
	}

	switch (type) {

	case REQ_DEVICE_INFO:
		{
			dzlog_debug("get device info\r\n");
			RES_DEVICE_INFO_T res;
			res.code = 0;
			snprintf((char *)res.sn, 16, "%s", "AB12345678");
			get_md5((unsigned char *)res.sn_md5, (char const *)res.sn, 1);
			snprintf((char *)res.fw_ver, 4, "%c%c%c%c", 1,0,0,0);
			snprintf((char *)res.hw_ver, 4, "%c%c%c%c", 1,0,1,0);
			res.Encrypted = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SET_SN:
		{
			REQ_SET_SN_T *req = (REQ_SET_SN_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set sn : %s\r\n", req->sn);


			RES_SET_SN_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
		case REQ_GET_TIME:
		{
			dzlog_debug("get rtc time 1555733950\r\n");
			RES_GET_TIME_T res;
			res.time_sec = 1555733950;//jd_master_com_get_system_time_second();
			res.time_usec = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SET_TIME:
		{
			REQ_SET_TIME_T * req = (REQ_SET_TIME_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set time sec %d \r\n", req->time_sec);

			RES_SET_TIME_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_FLASH_LED:
		{
			REQ_SET_FLASH_LED_T *req = (REQ_SET_FLASH_LED_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set flash led %d\r\n", req->led_status);


