zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
			RES_SET_FLASH_LED_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SLOT_LED:
		{
			REQ_SET_SLOT_LED_T *req = (REQ_SET_SLOT_LED_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d led to %d\r\n", req->slot_num, req->led_status);


			RES_SET_SLOT_LED_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SLOT_ELOCK:
		{
			REQ_SET_SLOT_ELOCK_T *req = (REQ_SET_SLOT_ELOCK_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d lock to %d\r\n", req->slot_num, req->elock_status);


			RES_SET_SLOT_ELOCK_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SLOT_POWER:
		{
			REQ_SET_SLOT_POWER_T *req = (REQ_SET_SLOT_POWER_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set slot %d power to %d\r\n", req->slot_num, req->power_status);

			RES_SET_SLOT_POWER_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_SLOT_KEY_STAT:
		{
			REQ_GET_SLOT_KEY_T *req = (REQ_GET_SLOT_KEY_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("get slot %d key status\r\n", req->slot_num);

			RES_GET_SLOT_KEY_T res;
			res.code = 0;
			res.key_status = 1;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_BATTERY_ENCRYPT:
		{
			REQ_BATTERY_ENCRYPT_T *req = (REQ_BATTERY_ENCRYPT_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("set battery %d opt %d\r\n", req->slot_num, req->opt);

			RES_BATTERY_ENCRYPT_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_BATTERY_INFO:
		{
			REQ_BATTERY_INFO_T *req = (REQ_BATTERY_INFO_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("get battery %d info opt %d\r\n", req->slot_num, req->opt);

			RES_BATTERY_INFO_T res;
			res.code = 0;
			snprintf((char *)res.sn, 16, "%s", "BAT1234567");
			res.temperature = 23;
			res.voltage = 4100;	//电压
			res.current = 0;	//电流
			res.full_cap = 5200;	//满电�?
			res.rem_cap = 4000;	//剩余电量
			res.charge_cnt = 8; //充放电次�?
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_GPRS_MODULE_INFO:
		{
			dzlog_debug("get gprs info\r\n");

			RES_GPRS_MODULE_INFO_T res;
			res.code = 0;	//响应代码：ok �?，fail�?
			snprintf(res.module_name,16, "%s", "MITU"); //模块�?
			memcpy(res.Iccid, "12345678901234567890", 20); //iccid
			res.module_ready = 1;//模块是否正常
			res.simcard_ready = 1;//sim卡是否正�?
			res.gprs_ready = 1;	//gprs 是否正常
			res.rssi = 20;		//rssi
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_GPRS_CONNECT:
		{
			REQ_GPRS_CONNECT_T * req = (REQ_GPRS_CONNECT_T*)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("gprs connect opt %d\r\n", req->opt);

			RES_GPRS_CONNECT_T res;
			res.code = 0;	//响应代码：ok �?，fail�?
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_DEVICE_AGEING:
		{
			REQ_AGEING_T *req = (REQ_AGEING_T *)pt + sizeof(MSG_UART_HEAD_T);
			dzlog_debug("ageing opt %d\r\n", req->opt);
			RES_AGEING_T res;
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
	case REQ_ENV_TEMPRATURE:
		{
			dzlog_debug("get temprature\r\n");
			RES_TEMPRATURE_T res;
			res.code = 0;
			res.temperature = 23;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		default:
			break;
	}

FREE:
	if(has_send_res != true){
		if(is_req_type_valid(type)){
			RES_COMMON_T res;

			dzlog_error("%s: type %d exception res start to send...\r\n",__func__,type);
			res.code = 1;
			jd_master_com_send_exception_response(hdl,type,(void *)&res);
		}
		else
			dzlog_error("%s:[unknown type=%02x]won't send res as invalid packet received!!!\r\n",
				__func__,type);
	}
	jd_om_free(pt);
	return 0;
}

#if 0
	switch (type) {
		case REQ_DEVICE_INFO:
		{
			RES_DEVICE_INFO_T *res = NULL;

			jd_master_com_fill_device_info(hdl,&res);
			//send response to host
			jd_master_com_send_response(hdl,type,(void *)res);
			jd_om_free(res);
			has_send_res = true;
			break;
		}

		case REQ_CONFIG_PASSWORD:
		{
			REQ_CONFIG_PASSWORD_T *req = (REQ_CONFIG_PASSWORD_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_CONFIG_PASSWORD_T res;
			res.code = jd_master_com_set_communication_cipher(req->cipher_len,req->cipher);
			if(res.code == 0){
				//refresh communication cipher.
				memset(hdl->cipher,0,sizeof(hdl->cipher));
				jd_master_com_get_communication_cipher(sizeof(hdl->cipher),hdl->cipher);
			}
			//send response to host
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		case REQ_GET_TIME:
		{
			RES_GET_TIME_T res;
			res.time_sec = jd_master_com_get_system_time_second();
			res.time_usec = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		case REQ_SET_TIME:
		{
			REQ_SET_TIME_T *req = (REQ_SET_TIME_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_SET_TIME_T res;
			jd_master_com_set_system_time(req->time_sec);
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		case REQ_SET_VOLUME:
		{
			REQ_SET_VOLUME_T *req = (REQ_SET_VOLUME_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_SET_VOLUME_T res;

			if((voice_volume_level)(req->volume)>volume_high){
				dzlog_error("wrong desired volume '%d'\r\n",req->volume);
			}
			else{
				//start to set volume
				jd_master_com_send_play_msg(hdl,type,(void *)req);
				res.code = 0;
				jd_master_com_send_response(hdl,type,(void *)&res);
				has_send_res = true;
			}
			break;
		}

		case REQ_CLEAR_PASSWORD:
		{
			RES_CLEAR_PASSWORD_T res;

			jd_master_com_clear_communication_cipher();
			//refresh communication cipher.
			memset(hdl->cipher,0,sizeof(hdl->cipher));
			res.code = 0;
			//send response to host
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

