zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
		case REQ_SET_SN:
		{
			REQ_SET_SN_T *req = (REQ_SET_SN_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_SET_SN_T res;
			res.code = jd_master_com_set_dev_sn(req->sn);
			//send response to host
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		case REQ_SET_DEVICE_ID:
		{
			REQ_SET_DEVICE_ID_T *req = (REQ_SET_DEVICE_ID_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_SET_DEVICE_ID_T res;
			res.code = jd_master_com_set_dev_id(req->device_id);
			//send response to host
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		case REQ_SHOW:
		{
			REQ_SHOW_T *req = (REQ_SHOW_T *)(pt + sizeof(MSG_UART_HEAD_T));
			RES_SHOW_T res;
			if(hdl->uart_comm_des.current_schedule->InCritical){
				dzlog_error("########Ignore REQ_SHOW under critical 'service code=%d'##########\r\n",
					req->service_code);
				//send response to host
				res.code = 1;
			}
			else{
				//send to play task to process
				jd_master_com_send_play_msg(hdl,type,(void *)req);
				//jd_om_pthread_cond_timedwait(0);
				//send response to host
				res.code = 0;
			}
			jd_master_com_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}

		//recevicing file here.
		case REQ_TRANS_FILE_HEAD:
		{
			REQ_TRANS_FILE_HEAD_T *req = (REQ_TRANS_FILE_HEAD_T *)(pt + sizeof(MSG_UART_HEAD_T));
			if(strlen(recv_file_des.file_path)>0){
				dzlog_error("###############last transfer file '%s' not closed#############\r\n",
					recv_file_des.file_path);
				f_sync(&(recv_file_des.file_handle));
				f_close(&(recv_file_des.file_handle));
			}
			memset(recv_file_des.version,0,4);
			memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);
			memset(recv_file_des.md5, 0, MD5_SIZE);
			memcpy(recv_file_des.md5, req->md5, MD5_SIZE);
			recv_file_des.size = req->size;
			recv_file_des.type = req->type;
			recv_file_des.aes_padding_len = 0;	//init aes padding length.
			old_pkt_id = 1;
			if((recv_file_des.type == voice_file) && (!ends_with(req->file_name,".mp3"))){
				dzlog_error("voice type mismatch with file name '%s'###\r\n",req->file_name);
			}
			else{
				jd_master_com_send_play_msg(hdl,type,(void *)req);
				file_transfer_start(hdl,req->file_name);
				*trans_timeout_cnt = 0;
				*file_trans = true;
				has_send_res = true;
			}
			break;
		}

		case REQ_TRANS_FILE_DATA:
		{
			REQ_TRANS_FILE_DATA_T *req = (REQ_TRANS_FILE_DATA_T *)(pt + sizeof(MSG_UART_HEAD_T));
			if (old_pkt_id != req->packet_id) {
				old_pkt_id = req->packet_id;
				file_transfer_going(hdl,req->packet_id, (char *)&(req->packet_id) + 4, payload_len - 4);
				*trans_timeout_cnt = 0;
				has_send_res = true;
			}
			else{
				dzlog_error("recv a same fragment id=%d\r\n",old_pkt_id);
			}
			break;
		}

		case REQ_TRANS_FILE_END:
		{
			file_transfer_end(hdl);
			*trans_timeout_cnt = 0;
			has_send_res = true;
			break;
		}

		case REQ_NOTIFY_ALL_FILE_COMPLETED:
		{
			RES_NOTIFY_ALL_FILE_COMPLETED_T res;

			//send to play task to process
			jd_master_com_send_play_msg(hdl,type,NULL);
			//send response to host
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			*trans_timeout_cnt = 0;
			*file_trans = false;
			has_send_res = true;
			break;
		}

		default:
			break;
	}
#endif

void uart_recv_queue_task(void const *p)
{
	jd_om_comm *hdl = (jd_om_comm *)p;
	void *pt = NULL;
	unsigned int disconnect_cnt = 0,lose_times = 0;
	unsigned int loseMaximumSec = 0;
	bool ever_disconnect_notify = false;
	//REQ_SHOW_T req;
	bool fileTransering = false;
	UINT fileTransTimeCnt = 0;

	dzlog_info("%s start\r\n", __func__);
	memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);

	while (1) {
		//daemon_flag_clear(uart_daemon);
		//dzlog_debug("%s:@@1@@\r\n",__func__);
		jd_om_mq_recv(&(hdl->uart_comm_des.recv_queue), (void **)&pt, 1000/*millisecond timeout*/);

		//dzlog_debug("%s:##2##\r\n",__func__);
		#if 0
		if(fileTransering){
			if(fileTransTimeCnt++>50){
				//we've too much time not received host data transfer,so force to interrupt it.
				dzlog_debug("uart_recv_queue_task>>>wait data transfer timeout,force to interrupt it!!!\r\n");
				jd_master_com_send_play_msg(hdl,REQ_NOTIFY_ALL_FILE_COMPLETED,NULL);
				fileTransering = false;
				fileTransTimeCnt = 0;
			}
		}
		#endif

		if(pt == NULL){
			//printf("%s:%d\r\n", __func__, __LINE__);
			//dzlog_error("%s: timeout\r\n",__func__);
			if(lose_times>0)
				loseMaximumSec = 420;	// seconed time or later detection:5 minutes + 2 minutes alarm.
			else
				loseMaximumSec = 300;	// first time detection:5 minutes timeout.
			if(disconnect_cnt++ >= loseMaximumSec){	// only trigger one time.
				dzlog_debug("%s:##lose connect %d seconds with host##\r\n",__func__,loseMaximumSec);
				//req.service_code = srv_code_connect_fail;
				//req.keep_alive = 0;
				//jd_master_com_send_play_msg(hdl,REQ_SHOW,&req);
				ever_disconnect_notify = true;
				disconnect_cnt = 0;	//stop counter
				lose_times++;
			}
		}
		else{
			if(ever_disconnect_notify){
				//req.service_code = srv_code_default;
				//req.keep_alive = 5;
				//jd_master_com_send_play_msg(hdl,REQ_SHOW,&req);
				ever_disconnect_notify = false;
			}
			disconnect_cnt = 0;	//stop counter
			lose_times = 0;
			if(strncmp((char *)pt,ReqNameByAT,strlen(ReqNameByAT))==0){
				dzlog_debug("%s:recv req AT name\r\n",__func__);
				jd_om_free(pt);
			}
			else{
				recv_data_dispatch(hdl,(char *)pt,&fileTransering,&fileTransTimeCnt);
			}
		}
	}
}

static void send_err_recovery(jd_om_comm *hdl,unsigned char ActiveReq)
{

}


void uart_send_queue_task(void const *p)
{
	jd_om_comm *hdl = (jd_om_comm *)p;
	int slave = SLAVE_1;
	int ret;
	int lens;
	void *pt = NULL;
	jd_om_comm_addr to_addr;
	char slave_addr[16] = { 0 };
	int cnt_resend = 0;
	int send_err = 0;
	unsigned char active_req = 0;

	dzlog_info("%s start\r\n", __func__);

	//char buf[128];

#if 0
	while(1) {
		//osDelay(1000);
		//jz_uart_write_ex(0, "hello\r\n", 7, 1000);
		memset(buf, 128, 0);
		ret = jz_uart_read_ex(0, buf, 128, 1000);
		if (ret)
			print_hex((char *)__func__,buf, ret);
			//printf("recv : %s\r\n", buf);
		else
			printf("recv no data\r\n");
	}
#endif
	while (1) {
		MSG_UART_HEAD_T *head = NULL;
		char res;
		jd_om_mq_recv(&(hdl->uart_comm_des.send_queue), (void **)&pt, 0);
		if(pt == NULL){
			dzlog_error("%s: invalid message: NULL\r\n",__func__);
			continue;
		}

		head = (MSG_UART_HEAD_T *)pt;
		lens = sizeof(MSG_UART_HEAD_T) + head->payload_len + CHECKSUM_SIZE;
		print_hex((char *)__func__,pt, lens);
		res = head->type;
		if (!is_res_type_valid(res)) {
			dzlog_error("invalid request 0x%02x\r\n", res);
			jd_om_free(pt);
			continue;
		}

