zhaofeng0327/stm32f7/nucleo-f746zg-freerots/source/uart_comm/uart_comm.c
	// 获取type字段
	type = head->type;
	dzlog_debug("recv type %02x\r\n", type);

	//判断start字段值是否正�?
	if (!is_req_type_valid(type)){
		has_send_res = true;	//don't send res as valid command type
		goto FREE;
	}

	if(head->packet_id == last_session_id){
		dzlog_error("recv repeat packet\r\n");
		goto FREE;
	}
	else{
		last_session_id = head->packet_id;
	}

	// 获取payload_len字段
	//payload_len = 0;
	//memcpy(&payload_len, &(head->payload_len), sizeof(payload_len));
	payload_len = head->payload_len;

	// 校验payload_len合法�?
	if (payload_len >= MAX_QUEUE_ELEMENT_SIZE) {
		dzlog_error("recv invalid payload_len:%d\r\n",payload_len);
		goto FREE;
	}

	// 获取payload
	memset(payload, 0, MAX_QUEUE_ELEMENT_SIZE);
	memcpy(payload, pt + sizeof(MSG_UART_HEAD_T), payload_len);


	//获取checksum
	unsigned short chksum;
	memcpy(&chksum, pt + sizeof(MSG_UART_HEAD_T) + payload_len, sizeof(chksum));
	if (chksum != crc16(pt, sizeof(MSG_UART_HEAD_T) + payload_len)) {
		dzlog_error("checksum wrong\r\n");
		goto FREE;
	}

	switch (type) {
		case REQ_GET_TIME:
		{
			RES_GET_TIME_T res;
			res.time_sec = 1555733950;//jd_master_com_get_system_time_second();
			res.time_usec = 0;
			uart_send_response(hdl,type,(void *)&res);
			has_send_res = true;
			break;
		}
		default:
			break;
	}

FREE:
	if(has_send_res != true){
		if(is_req_type_valid(type)){
			RES_COMMON_T res;

			dzlog_error("%s:exception res start to send...\r\n",__func__,type);
			res.code = 1;
			uart_send_exception_response(hdl,type,(void *)&res);
		}
		else
			dzlog_error("%s:[unknown type=%02x]won't send res as invalid packet received!!!\r\n",
				__func__,type);
	}
	//jd_om_free(pt);
	return 0;
}

void uart_task(void const *p)
{
	jd_om_comm *uart_hdl = (jd_om_comm *)p;
	int r_len;
	jd_om_comm_addr from_addr;
	char buf[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	char *pt;

	//task of receving.
	while (1) {
		memset(buf, 0, MAX_QUEUE_ELEMENT_SIZE);

		dzlog_debug("uart recv start>>>\r\n");
		r_len = jd_om_recv(uart_hdl, &from_addr, buf, MAX_QUEUE_ELEMENT_SIZE);
		if ((r_len > sizeof(MSG_UART_HEAD_T)) ||
			((r_len == strlen(ReqNameByAT)) && (strncmp(buf,ReqNameByAT,r_len)==0))) {
			print_hex((char *)__func__,buf, r_len);
			uart_data_dispatch(uart_hdl,buf,0,0);
			//jd_om_mq_send(&(uart_hdl->uart_comm_des.recv_queue), pt);
			//dzlog_debug("%s:send recv queue end...\r\n",__func__);
		}
		else{
			dzlog_error("recv msg from uart. invalid len:%d\r\n", r_len);
		}
	}
}


#endif
#ifdef AES_CBC_256_DBG
static void aes_cbc_encrypt_desrypt_testing(char *in_string)
{
	uint8_t key[] = { 0x60, 0x3d, 0xeb, 0x10, 0x15, 0xca, 0x71, 0xbe, 0x2b, 0x73, 0xae, 0xf0, 0x85, 0x7d, 0x77, 0x81,
					  0x1f, 0x35, 0x2c, 0x07, 0x3b, 0x61, 0x08, 0xd7, 0x2d, 0x98, 0x10, 0xa3, 0x09, 0x14, 0xdf, 0xf4 };
	unsigned char iv[AES_BLOCKLEN];		 // init vector
	struct AES_ctx ctx;
	unsigned char *in;
	unsigned int len;		 // encrypt length (in multiple of AES_BLOCK_SIZE)
	unsigned char padding_len = 0;
	int i;

	dzlog_info("################aes_cbc test start################\r\n");
	dzlog_info("input string: [len=%d,%s]\r\n",strlen(in_string),in_string);
	len = 0;
	/*
	padding PKCS7 is recommendable.
	01
	02 02
	03 03 03
	04 04 04 04
	05 05 05 05 05
	06 06 06 06 06 06
	etc.
	*/
	if ((strlen(in_string) + 1) % AES_BLOCKLEN == 0) {
		len = strlen(in_string) + 1;
	} else {
		len = ((strlen(in_string) + 1) / AES_BLOCKLEN + 1) * AES_BLOCKLEN;
	}

	 padding_len = len-strlen(in_string);

	// set the input string
	in = (unsigned char*)jd_om_malloc(len);
	if (in == NULL) {
		dzlog_error("Unable to allocate memory for input_string\r\n");
		return;
	}
	memset(in,padding_len,len);
	strncpy((char*)in, in_string, strlen(in_string));

   dzlog_info("original string hex[len=%d,padding_len=%d]: \r\n",len,padding_len);
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //dzlog_info("\r\n");

	//encrypt start(iv will change)
	for (i=0; i<AES_BLOCKLEN; ++i) {
		iv[i] = 0;
	}
	AES_init_ctx_iv(&ctx, key, iv);
	AES_CBC_encrypt_buffer(&ctx, in, len);
	dzlog_info("CBC encrypted hex[len=%d]: \r\n",len);
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //dzlog_info("\n");

   //decrypt start(iv will change)
	for (i=0; i<AES_BLOCKLEN; ++i) {
		iv[i] = 0;
	}
   AES_init_ctx_iv(&ctx, key, iv);
   AES_CBC_decrypt_buffer(&ctx, in, len);
   dzlog_info("CBC decrypted hex: \r\n");
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //real data after trim the padding
   padding_len = in[len-1];
   len -= padding_len;
   dzlog_info("CBC decrypted hex after trim padding: \r\n");
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   dzlog_info("\r\n");
   memset(&(in[len]),0,padding_len);

   dzlog_info("CBC decrypted string: [%s]\r\n",in);
   dzlog_info("################aes_cbc test end################\r\n");
   jd_om_free(in);
}
#endif

int uart_task_init(jd_om_comm *uart_hdl)
{
	int ret = 0;
	jd_om_comm_addr local_addr;
	jd_om_comm_addr addr_mask;

	//jd_master_com_clear_communication_cipher();
	//eeprom_setting_show_test();

	if (jd_om_mutex_create(&(uart_hdl->uart_comm_des.mutex_active_req)) != osOK){
		dzlog_error("mutex_active_req init error\r\n");
		vTaskSuspend(NULL);
	}

	if (jd_om_mutex_create(&(uart_hdl->uart_comm_des.mutex_active_res)) != osOK){
		dzlog_error("mutex_active_res init error\r\n");
		vTaskSuspend(NULL);
	}

#if 0
	//get communication cipher.
	memset(uart_hdl->cipher,0,sizeof(uart_hdl->cipher));
	jd_master_com_get_communication_cipher(sizeof(uart_hdl->cipher),uart_hdl->cipher);
#endif

	local_addr.addr = tlc_iaddr("1.0.0");
	addr_mask.addr = tlc_iaddr("255.0.0");

	ret = jd_om_comm_open(uart_hdl, &local_addr, &addr_mask, UART_NUM);
	if (0 != ret) {
		dzlog_error("open uart number %d fail ret %d.\r\n", UART_NUM, ret);
		vTaskSuspend(NULL);
	}

#if 1
	/* definition and creation of uartSendQueueTask */
	osThreadDef(uartSendQueueTask, uart_send_queue_task, osPriorityNormal, 0, 1024);
	uart_hdl->uart_comm_des.thread_handle_send = osThreadCreate(osThread(uartSendQueueTask), uart_hdl);
	if(uart_hdl->uart_comm_des.thread_handle_send == NULL){
		printf("create send thread fail.\r\n");
		while (1)
			;
	} else {
		printf("Uart_send_queue_task create successful !\r\n");
	}

	/* definition and creation of uartRecvQueueTask */
	osThreadDef(uartRecvQueueTask, uart_recv_queue_task, osPriorityNormal, 0, 5120);
	uart_hdl->uart_comm_des.thread_handle_recv = osThreadCreate(osThread(uartRecvQueueTask), uart_hdl);
	if(uart_hdl->uart_comm_des.thread_handle_recv == NULL){
		printf("create recv thread fail.\r\n");
		while (1);
	} else {
		printf("Uart_recv_queue_task create successful !\r\n");
	}

	/* definition and creation of uartRecv */
	osThreadDef(uartRecv, uart_recv_task, osPriorityNormal, 0, 1024);
	if (NULL == osThreadCreate(osThread(uartRecv), uart_hdl)) {
		printf("create Uart recv Task failed!.\r\n");
		while (1);
	} else {
		printf("Uart recv task create successful !\r\n");
	}

#else
	osThreadDef(uartTask, uart_task, osPriorityNormal, 0, 5120);
	if (NULL == osThreadCreate(osThread(uartTask), uart_hdl)) {
		printf("create Uart Task failed!.\r\n");
		while (1);
	} else {
		printf("Uart task create successful !\r\n");
	}
#endif

#ifdef AES_CBC_256_DBG
	aes_cbc_encrypt_desrypt_testing("123456789012345");		//15 bytes
	aes_cbc_encrypt_desrypt_testing("1234567890123456");	//16 bytes
	aes_cbc_encrypt_desrypt_testing("12345678901234567");	//17 bytes
#endif


	return 0;
}

//HOOK function to detect task stack overflow!
void vApplicationStackOverflowHook( TaskHandle_t xTask, signed char *pcTaskName )
{
     dzlog_error("task:[%s] ######stack overflow######\r\n", pcTaskName);
}


